# ციკლი - არის მას გააჩნია დაწყება,გადაკვეთა ანუ საიდან სადამდე გადავიდეს დასასრული. და ბევრი კოდის დაწერა რო არ გამომივიდეს მაშინ იყენებენ მას
# საიტერაციო ცვლადს გააჩნია თავისი სახელები ყველაზე გავცელებული სახელებია: i, x, y, num,string და z და მას ვიყენებთ for ციკლის შემდეგ მაგალითად for i და საე შემდეგ
# კოდის ბლოკი - არის როცა ციკლი გაეშვება რა კოდი უნდა დაწეროს
for i in range(10,30):
     print(i)

for i in range(20,41):
     print(i)

for i in range(50,62,2):
     print(i)

for i in range(11,50,2):
    print(i)

numbers_sum = 0
for i in range(10,20):
    numbers_sum = numbers_sum + i
print(i)