# მეოთხე დავალება.
# def - define -  შექმნა / ჩამოყალიბება და მას ვიყენებთ ფუნქციის შქმნაში.
# function name - ფუნქციის სახელი მაგალითად არის print, input.
# function parameter - პარამეტრი მიიღებს რაღაც ინფრომაციას ფუნქციის გამოძახებისას და ამ ინფორმაცია გამოიყენებს ფუნქცია
# indetation - 1 ტაბით მარჯვნივ გადასვლას. ესეიგი რაღც ბრძანებაშია მოქცეული
# code block - არის როცა ციკლი გაეშვება რა კოდი უნდა დაწეროს
# function call - გამოძახება და იგი შეგვიძლია გომაციძახოთ: დავწეროთ ფუნქციის სახელი,
# გავხსნათ ფრჩხილები და თუ საჭიროა ფუნქციას გავუწეროთ არგუმენტები
# function argument - ფუნქციის გამოძხების მომენტში ფრჩხილებშ გადაცემული ნებისმიერი ინფორმაცია 

# პირველი დავალება
def level32(x,y):
    return x + y


# მეორე დავალება
def hw_2(g):
    return g[::-1]

# მესამე დავალება
def hw_3(i):
    return max(i)